docs/samples/source/sample.org
#+TITLE: Sample
#+AUTHOR: Author
#+EMAIL: foo@bar.com
#+OPTIONS: toc:3 num:nil ^:nil

* H1 - one '*'s
** H2 - two '*'s
*** H3 - three '*'s
**** H4 - four '*'s
***** H5 - five '*'s

** Source Blocks
This is the sort of configuration used to generate this sample:
  #+begin_src emacs-lisp
    (setq org-publish-project-alist
          `(("nice-org-html/samples/X"
             :base-directory "nice-org-html/samples/source"
             :publishing-directory "nice-org-html/samples/X"
             :htmlize-source t
             :with-toc t
             ;; ...
             :publishing-function
             ,(nice-org-html-publishing-function
               :theme-alist ((light . <light-theme>) (dark . <dark-theme>))
               :default-mode dark
               :header (("SITE NAME" . "/route/to/home.html")
                        ("Foo" . "/route/to/foo.html")
                        ("Bar" . "/route/to/bar.html")
                        ("Baz" . "/route/to/baz.html"))
               :footer (("© Author Name" . "mailto:a@b.com")
                        ("GitHub" . "https://github.com/ewantown")
                        ("LinkedIn" . "https://linkedin.com/me"))))))
  #+end_src

** Pretty Symbols
+ Basic:

  \Gamma, \gamma, \Sigma, \sigma, \Delta, \delta

+ $\LaTeX$:

  $\Gamma \vdash \Delta$
  $\sigma(i) = \sum_{1}^{n} n - i$

** Table

|  a |  b |  c |  d |
|----+----+----+----+
|  0 |  1 |  2 |  3 |
|  6 |  7 |  8 |  9 |
| 12 | 13 | 14 | 15 |
| 18 | 19 | 20 | 21 |

** Lists
*** todo List
**** TODO todo
**** DONE done

*** Simple List
- item
- item
- item

*** Sorted List
1. item
2. item
3. item

*** Check List
- [ ] item
- [X] item





