docs/samples/eighties-jazz/sample.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sample</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="preamble" class="status">
<div id='generated-header' class='generated'><header>
 <nav>
<a class='nav-title'href='/route/to/home.html' >
SITE NAME
</a>
<input id='nav-toggle-top' class='nav-toggle' type='checkbox'>
<label class='nav-button' for='nav-toggle-top'><span/></label>
<div class='separator menu-sep'></div>
<ul class='nav-list'>
<li class='nav-item'>
<a class='nav-link' href='/route/to/foo.html'>
Foo</a>
</li>
<li class='nav-item'>
<a class='nav-link' href='/route/to/bar.html'>
Bar</a>
</li>
<li class='nav-item'>
<a class='nav-link' href='/route/to/baz.html'>
Baz</a>
</li>
</ul>
<div class='separator'></div>
</nav>
</header>
</div>
<div id='view-controls'><div id='toggle-mode' title='Mode'>&#9788;</div><div id='goto-top' title='Top'>&#8963;</div><div id='toggle-toc' title='Contents'>&#9776;</div></div>
</div>
<div id="content" class="content">
<h1 class="title">Sample</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org526ee7f">H1 - one '*'s</a>
<ul>
<li><a href="#org3a7aa8c">H2 - two '*'s</a>
<ul>
<li><a href="#org2f94b2d">H3 - three '*'s</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdf5b086">Source Blocks</a></li>
<li><a href="#org2272e12">Pretty Symbols</a></li>
<li><a href="#org830d3c4">Table</a></li>
<li><a href="#orgfee26ed">Lists</a>
<ul>
<li><a href="#orgb06640e">todo List</a></li>
<li><a href="#orgd8c02e4">Simple List</a></li>
<li><a href="#orgcf0031e">Sorted List</a></li>
<li><a href="#orga9516a8">Check List</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org526ee7f" class="outline-2">
<h2 id="org526ee7f">H1 - one '*'s</h2>
<div class="outline-text-2" id="text-org526ee7f">
</div>
<div id="outline-container-org3a7aa8c" class="outline-3">
<h3 id="org3a7aa8c">H2 - two '*'s</h3>
<div class="outline-text-3" id="text-org3a7aa8c">
</div>
<div id="outline-container-org2f94b2d" class="outline-4">
<h4 id="org2f94b2d">H3 - three '*'s</h4>
<div class="outline-text-4" id="text-org2f94b2d">
</div>
<div id="outline-container-org87537c7" class="outline-5">
<h5 id="org87537c7">H4 - four '*'s</h5>
<div class="outline-text-5" id="text-org87537c7">
</div>
<div id="outline-container-orgf8bcc21" class="outline-6">
<h6 id="orgf8bcc21">H5 - five '*'s</h6>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdf5b086" class="outline-2">
<h2 id="orgdf5b086">Source Blocks</h2>
<div class="outline-text-2" id="text-orgdf5b086">
<p>
This is the sort of configuration used to generate this sample:
</p>
<div class='org-src-wrapper'>
<div class='org-src-bar'><span class='srcLangLabel'>ELISP</span><button class='copyBtn' name=btn_0f185f98b7e7412e96e0408994d0cfae>&#10697;</button>
<script type='text/javascript'>
var copyBtnbtn_0f185f98b7e7412e96e0408994d0cfae=document.querySelector('button[name=btn_0f185f98b7e7412e96e0408994d0cfae]');
copyBtnbtn_0f185f98b7e7412e96e0408994d0cfae.addEventListener('click', function(event) {
let res = copyTextToClipboard(`(setq org-publish-project-alist\n      \`((\"nice-org-html/samples/X\"\n         :base-directory \"nice-org-html/samples/source\"\n         :publishing-directory \"nice-org-html/samples/X\"\n         :htmlize-source t\n         :with-toc t\n         ;; ...\n         :publishing-function\n         ,(nice-org-html-publishing-function\n           :theme-alist ((light . <light-theme>) (dark . <dark-theme>))\n           :default-mode dark\n           :header ((\"SITE NAME\" . \"/route/to/home.html\")\n                    (\"Foo\" . \"/route/to/foo.html\")\n                    (\"Bar\" . \"/route/to/bar.html\")\n                    (\"Baz\" . \"/route/to/baz.html\"))\n           :footer ((\"© Author Name\" . \"mailto:a@b.com\")\n                    (\"GitHub\" . \"https://github.com/ewantown\")\n                    (\"LinkedIn\" . \"https://linkedin.com/me\"))\n           :collapsing t\n           :src-lang t))))\n`);copyBtnbtn_0f185f98b7e7412e96e0408994d0cfae.innerHTML = res ? '&#10003;' : 'error';setTimeout(() => { copyBtnbtn_0f185f98b7e7412e96e0408994d0cfae.innerHTML = '&#10697;'}, 3000);
});
</script>
</div><div class="org-src-container">
<pre class="src src-elisp">(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">setq</span> org-publish-project-alist
      `((<span style="color: var(--clr-string); background-color: var(--bg-string);">"nice-org-html/samples/X"</span>
         <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:base-directory</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"nice-org-html/samples/source"</span>
         <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:publishing-directory</span> <span style="color: var(--clr-string); background-color: var(--bg-string);">"nice-org-html/samples/X"</span>
         <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:htmlize-source</span> t
         <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:with-toc</span> t
         <span style="color: var(--clr-comment-delimiter); background-color: var(--bg-comment-delimiter);">;; </span><span style="color: var(--clr-comment); background-color: var(--bg-comment);">...</span>
         <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:publishing-function</span>
         ,(<span style="color: var(--clr-keyword); background-color: var(--bg-keyword);">nice-org-html-publishing-function</span>
           <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:theme-alist</span> ((light . &lt;light-theme&gt;) (dark . &lt;dark-theme&gt;))
           <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:default-mode</span> dark
           <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:header</span> ((<span style="color: var(--clr-string); background-color: var(--bg-string);">"SITE NAME"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"/route/to/home.html"</span>)
                    (<span style="color: var(--clr-string); background-color: var(--bg-string);">"Foo"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"/route/to/foo.html"</span>)
                    (<span style="color: var(--clr-string); background-color: var(--bg-string);">"Bar"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"/route/to/bar.html"</span>)
                    (<span style="color: var(--clr-string); background-color: var(--bg-string);">"Baz"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"/route/to/baz.html"</span>))
           <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:footer</span> ((<span style="color: var(--clr-string); background-color: var(--bg-string);">"&#169; Author Name"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"mailto:a@b.com"</span>)
                    (<span style="color: var(--clr-string); background-color: var(--bg-string);">"GitHub"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"https://github.com/ewantown"</span>)
                    (<span style="color: var(--clr-string); background-color: var(--bg-string);">"LinkedIn"</span> . <span style="color: var(--clr-string); background-color: var(--bg-string);">"https://linkedin.com/me"</span>))
           <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:collapsing</span> t
           <span style="color: var(--clr-builtin); background-color: var(--bg-builtin);">:src-lang</span> t))))
</pre>
</div></div>
</div>
</div>

<div id="outline-container-org2272e12" class="outline-2">
<h2 id="org2272e12">Pretty Symbols</h2>
<div class="outline-text-2" id="text-org2272e12">
<ul class="org-ul">
<li><p>
Basic:
</p>

<p>
&Gamma;, &gamma;, &Sigma;, &sigma;, &Delta;, &delta;
</p></li>

<li><p>
\(\LaTeX\):
</p>

<p>
\(\Gamma \vdash \Delta\)
\(\sigma(i) = \sum_{1}^{n} n - i\)
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org830d3c4" class="outline-2">
<h2 id="org830d3c4">Table</h2>
<div class="outline-text-2" id="text-org830d3c4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">a</th>
<th scope="col" class="org-right">b</th>
<th scope="col" class="org-right">c</th>
<th scope="col" class="org-right">d</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">7</td>
<td class="org-right">8</td>
<td class="org-right">9</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-right">13</td>
<td class="org-right">14</td>
<td class="org-right">15</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-right">19</td>
<td class="org-right">20</td>
<td class="org-right">21</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgfee26ed" class="outline-2">
<h2 id="orgfee26ed">Lists</h2>
<div class="outline-text-2" id="text-orgfee26ed">
</div>
<div id="outline-container-orgb06640e" class="outline-3">
<h3 id="orgb06640e">todo List</h3>
<div class="outline-text-3" id="text-orgb06640e">
</div>
<div id="outline-container-orgd24e3be" class="outline-5">
<h5 id="orgd24e3be"><span class="todo TODO">TODO</span> todo</h5>
</div>
<div id="outline-container-org5ffc9aa" class="outline-5">
<h5 id="org5ffc9aa"><span class="done DONE">DONE</span> done</h5>
</div>
</div>

<div id="outline-container-orgd8c02e4" class="outline-3">
<h3 id="orgd8c02e4">Simple List</h3>
<div class="outline-text-3" id="text-orgd8c02e4">
<ul class="org-ul">
<li>item</li>
<li>item</li>
<li>item</li>
</ul>
</div>
</div>

<div id="outline-container-orgcf0031e" class="outline-3">
<h3 id="orgcf0031e">Sorted List</h3>
<div class="outline-text-3" id="text-orgcf0031e">
<ol class="org-ol">
<li>item</li>
<li>item</li>
<li>item</li>
</ol>
</div>
</div>

<div id="outline-container-orga9516a8" class="outline-3">
<h3 id="orga9516a8">Check List</h3>
<div class="outline-text-3" id="text-orga9516a8">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> item</li>
<li class="on"><code>[X]</code> item</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id='generated-footer' class='generated'><footer>
 <nav>
<div class='separator'></div>
<a class='nav-author'href='mailto:e@etown.dev' >
© Ewan Townshend
</a>
<input id='nav-toggle-bot' class='nav-toggle' type='checkbox'>
<label class='nav-button' for='nav-toggle-bot'><span/></label>
<div class='separator menu-sep'></div>
<ul class='nav-list'>
<li class='nav-item'>
<a class='nav-link' href='https://github.com/ewantown'>
GitHub</a>
</li>
<li class='nav-item'>
<a class='nav-link' href='https://linkedin.com/in/ewan-townshend'>
LinkedIn</a>
</li>
</ul>
</nav>
</footer>
</div>
<script type="text/javascript">
<!--/*--><![CDATA[/*><!--*/
if (!document.cookie.split('; ').find(r => r.startsWith('mode'))) {
document.cookie = 'mode=dark'
}
document.cookie = 'light=solo-jazz'
document.cookie = 'dark=tomorrow-night-eighties'
document.cookie = 'options=collapsing:t__src-lang:t';
/*
;; nice-org-html.js
;;==============================================================================
;; Copyright (C) 2024, Ewan Townshend

;; Author: Ewan Townshend
;; URL: https://github.com/ewantown/nice-org-html
;; Version: 1.2

;;==============================================================================
;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

;; This file is not part of emacs.

;;==============================================================================
;; JS for html exported by et-org-html.el
 */

const preamble = document.getElementById("preamble");
const content = document.getElementById("content");
const postamble = document.getElementById("postamble");

const controls = document.getElementById("view-controls");
const toggleTocBtn = document.getElementById("toggle-toc");
const gotoTopBtn = document.getElementById("goto-top");
const toggleModeBtn = document.getElementById("toggle-mode");
const toc = document.getElementById("table-of-contents");

// Get and parse options passed in cookie string
const optCookie = document.cookie.split('; ').find(r => r.startsWith('options'));
const options = {};
if (optCookie) {
  optCookie.split('=')[1].split('__').forEach(pair => {
    const [key, val] = pair.split(':');
    if (key && val) {
      options[key] = val;
    }
  })
}

// Move sticky control bar (injected within preamble)
document.body.insertBefore(controls, content);

// Mode handling
function getMode() {
  let cookie = document.cookie.split('; ').find(r => r.startsWith('mode'))
  return cookie && cookie.split("=")[1];
}

function setMode(mode) {
  document.body.dataset.mode = mode;
  let thmCookie = document.cookie.split('; ').find(r => r.startsWith(mode));
  document.body.dataset.theme = thmCookie ? thmCookie.split('=')[1] : 'unknown';
  toggleModeBtn.innerHTML = (mode === 'light') ? '&#9789;' : '&#9788;';
  document.cookie = 'mode=' + mode;
}

// Initially, set mode based on stored cookie
let mode = getMode();
if (mode && ["light", "dark"].includes(mode)) {
  setMode(mode);
} else {  
  let prop = "prefers-color-scheme";
  let pref = (mode === "query") && window.matchMedia &&
    ["light", "dark"].find(s => window.matchMedia(`(${prop}: ${s})`).matches);
  setMode(pref || "dark"); // fallback: dark
}

// Mode toggling
toggleModeBtn.addEventListener('click', () => {
  setMode(document.body.dataset.mode === 'dark' ? 'light' : 'dark');
})


// Jump to top
let scrollY = document.documentElement.scrollTop;
window.addEventListener('scroll', () => {
  let atTop = document.documentElement.scrollTop <= preamble.offsetHeight;
  gotoTopBtn.dataset.show = !atTop + "";
});
gotoTopBtn.addEventListener('click', () => {
  window.scrollTo({
    top: 0,
    behavior: "smooth"
  });
})

// Table-of-contents toggling
if (toc) {
  toggleTocBtn.dataset.show = 'true';
  toggleTocBtn.addEventListener('click', () => {
    let showingToc = document.body.dataset.toc;
    scrollY = showingToc ? scrollY : document.documentElement.scrollTop;
    if (showingToc) {
      document.body.dataset.toc = '';
      document.documentElement.scrollTop = scrollY;
    } else {
      let tocHeight =
	Math.max(
	  window.innerHeight - controls.offsetHeight,
	  toc.offsetHeight
	);
      const header = document.getElementById("injected-header");
      if (header && (scrollY > header.offsetHeight)) {
	document.documentElement.scrollTop = preamble.offsetHeight;
      }
      toc.style.height = `${tocHeight}px`;
      document.body.dataset.toc = 'true';
    }
    toc.addEventListener('click', () => {
      if (document.body.dataset.toc) {
	document.body.dataset.toc = '';
	document.documentElement.scrollTop = scrollY;
      }
    })
  })
};

// Instrument anchor linking for sticky control bar
document.querySelectorAll('a[href^="#"]').forEach(anchor => {
  anchor.addEventListener('click', (e) => {
    e.preventDefault();
    const targetId = e.currentTarget.getAttribute('href');
    const target = document.querySelector(targetId);

    setTimeout(() => {
      const targetPos = target.getBoundingClientRect().top;
      let offset = targetPos + document.documentElement.scrollTop;
      offset -= controls.offsetHeight;
      window.scrollTo({
	top: offset,
	behavior: "smooth"
      });
    }, 0);
  });
});

function copyTextToClipboard(text) {
  // Make invisible textarea
  var textArea = document.createElement("textarea");
  textArea.style.position = 'fixed';
  textArea.style.top = 0;
  textArea.style.left = 0;
  textArea.style.width = '2em';
  textArea.style.height = '2em';
  textArea.style.padding = 0;
  textArea.style.border = 'none';
  textArea.style.outline = 'none';
  textArea.style.boxShadow = 'none';
  textArea.style.background = 'transparent';

  // Copy contents into it
  textArea.value = text;

  // Try to copy from it to clipboard
  document.body.appendChild(textArea);
  textArea.focus();
  textArea.select();
  var res;
  try {
    res = document.execCommand('copy');
  } catch (err) {
    res = false;
  }

  // Remove invisible textarea
  document.body.removeChild(textArea);

  return res;
}

// Handle the default header / footer drawers
const header = document.getElementById("generated-header");
const footer = document.getElementById("generated-footer");

if (header) {
  let toggle = header.querySelector("header nav input.nav-toggle");
  if (toggle) { toggle.checked = false; }
}
if (footer) {
  let nav = footer.querySelector("nav");
  let toggle = nav && nav.querySelector(".nav-toggle");
  let navList = nav && nav.querySelector(".nav-list");
  let navElem = navList && [...navList.querySelectorAll(".nav-item")];
  let numLink = navElem && navElem.length;
  if (numLink) {
    toggle.checked = false;
    toggle.addEventListener('change', () => {
      if (toggle.checked) {
	setTimeout(() => window.scrollTo({
	  behavior: 'smooth',
	  top: document.body.scrollHeight	  
	}), 88);
      }
   });
  }
}

function autoCompact() {
  var anchor, links, overlap, trivial;
  const domCompute = (node) => {
    if (node) {
      anchor = node.querySelector('.nav-title, .nav-author');
      links = node.querySelector('.nav-list');
      overlap = links.offsetLeft - 5 <= anchor.offsetLeft + anchor.offsetWidth;	
      trivial = links.offsetLeft === anchor.offsetLeft;
    }
  };
  let mediaMatch = window.matchMedia('(max-width: 768px)').matches;
  [header, footer].forEach(e => {
    if (e) {
      if (mediaMatch) {
	e.classList.add('compact');
      } else {
	domCompute(e);
	if (overlap && !trivial) {
	  e.classList.add('compact');
	} else {	
	  let clone = e.cloneNode(true);
	  clone.style.top = '-2000px';
	  clone.style.maxHeight = '0px';
	  clone.classList.remove('compact');
	  e.parentNode.insertBefore(clone, e);
	  domCompute(clone);
	  let toggle = e.querySelector('.nav-toggle');
	  if (!overlap && toggle && !toggle.checked) {
	    e.classList.remove('compact');
	  }
	  e.parentNode.removeChild(clone);
	}
      }
    }
  })
}

if ((header || footer)) {
  if (options.hasOwnProperty('layout')) {
    [header, footer].forEach(e => e ? e.classList.add(options.layout) : null);
  } else {
    autoCompact();
    window.addEventListener('resize', autoCompact);
  }
}

if (options.hasOwnProperty('src-lang') && options['src-lang'] == 't') {
  let labels = [...document.querySelectorAll('.srcLangLabel')];
  labels.forEach(l => l.style.display = 'inline-block');
}

if (options.hasOwnProperty('collapsing') && options.collapsing == 't') {
  let levels = [2, 3, 4, 5, 6];
  let containerPrefix = 'outline-container-';
  levels.forEach(l => {
    let containers = [...document.querySelectorAll(`.outline-${l}`)];
    containers.forEach(c => {
      let id = c.id.slice(containerPrefix.length);
      let headline = document.getElementById(id);
      let siblings = [...c.children].filter(child => child.id != id);
      headline.classList.add('collapsible');
      headline.addEventListener('click', () => {	
	if (headline.classList.contains('collapsed')) {
	  headline.classList.remove('collapsed');
	  siblings.forEach(child => {
	    child.classList.remove('hidden');
	  });	  
	} else {
	  headline.classList.add('collapsed');
	  siblings.forEach(child => {
	    child.classList.add('hidden');
	  });
	}
      })
    })
  })
}
/*]]>*/-->
</script><div hidden>Generated by: https://github.com/ewantown/nice-org-html</div>
</div>
</body>
</html>